AccumulationRegisters/ПозицииИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПозицииИнструментов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СвечиИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СвечиИнструментов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Open</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>High</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Low</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Close</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Volume</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакЗавершенностиСвечи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Таймфрейм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТаймфреймыСвечей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТаймфреймыСвечей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТаймфреймыСвечей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>_1Min</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>_5Min</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>_15Min</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>_1Hour</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>_Day</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>_Week</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыИсточникаИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыИсточникаИнструментов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТекущиеПозиции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдинИнструмент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеПозицииЗаПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписокИнструментов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РежимыЗагрузкиСвечей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>РежимыЗагрузкиСвечей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПолнаяЗагрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дозагрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерезагрузкаПериода</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/СвечиСервис/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ЗагрузитьСвечи(ПараметрыЗагрузки) Экспорт
    
    ПроверитьПараметрыЗагрузкиСвечей(ПараметрыЗагрузки.СписокИнструментов, ПараметрыЗагрузки.ДатаНачала, ПараметрыЗагрузки.ДатаОкончания, ПараметрыЗагрузки.Таймфрейм);
    
    Результат = Новый Структура;
    Результат.Вставить("ВсегоИнструментов", 0);
    Результат.Вставить("ОбработаноУспешно", 0);
    Результат.Вставить("Пропущено", 0);
    Результат.Вставить("Ошибок", 0);
    Результат.Вставить("КоличествоСвечей", 0);
    Результат.Вставить("СреднееКоличествоСвечейНаИнструмент", 0);
    Результат.Вставить("Ошибки", Новый Массив);
    
    Инструменты = ПолучитьИнструментыДляЗагрузки(ПараметрыЗагрузки);
    Результат.ВсегоИнструментов = Инструменты.Количество();
    
    Если Инструменты.Количество() = 0 Тогда
        Возврат Результат;
    КонецЕсли;
    
    Соединение = ИнтеграцияTInvestAPI.TInvest_СоздатьHTTPСоединение();
    
	МинимальнаяДатаСвечи = Неопределено;
	МаксимальнаяДатаСвечи = Неопределено;
	
    Для Каждого Инструмент Из Инструменты Цикл
        
        Попытка
            ПериодЗагрузки = ОпределитьПериодЗагрузкиПоИнструменту(Инструмент, ПараметрыЗагрузки);
            
            Если ПериодЗагрузки = Неопределено Тогда
                Результат.Пропущено = Результат.Пропущено + 1;
                Продолжить;
            КонецЕсли;
            
            КоличествоСвечей = СвечиСервис.ЗагрузитьСвечиПоИнструменту(
                Инструмент,
                ПериодЗагрузки.ДатаНачала,
                ПериодЗагрузки.ДатаОкончания,
                ПараметрыЗагрузки.Таймфрейм,
				Соединение
            );
            
            Результат.ОбработаноУспешно = Результат.ОбработаноУспешно + 1;
            Результат.КоличествоСвечей = Результат.КоличествоСвечей + КоличествоСвечей;
			//МинимальнаяДатаСвечи = Мин(МинимальнаяДатаСвечи, ПериодЗагрузки.ДатаНачала);
			//МаксимальнаяДатаСвечи = Неопределено;
            
        Исключение
            Результат.Ошибок = Результат.Ошибок + 1;
            
            ТекстОшибки = ИнформацияОбОшибке().Описание;
            Результат.Ошибки.Добавить(
                Новый Структура("Инструмент,Ошибка", Инструмент, ТекстОшибки)
            );
        КонецПопытки;
        
    КонецЦикла;
	
	Результат.СреднееКоличествоСвечейНаИнструмент = Результат.КоличествоСвечей / Результат.ВсегоИнструментов;

    Возврат Результат;
    
КонецФункции

// Загружает свечи по инструменту и записывает их в регистр сведений СвечиИнструментов.
// Параметры:
//  Инструмент      - СправочникСсылка.Инструменты
//  ДатаНачала      - Дата
//  ДатаОкончания   - Дата
//  Таймфрейм       - ПеречислениеСсылка.ТаймфреймыСвечей
// Возвращает:
//  Число - количество записанных/обновленных свечей
Функция ЗагрузитьСвечиПоИнструменту(Инструмент, ДатаНачала, ДатаОкончания, Таймфрейм, Соединение) Экспорт
    
    ПроверитьПараметрыЗагрузкиСвечей(Инструмент, ДатаНачала, ДатаОкончания, Таймфрейм);
    
    ИдентификаторИнструмента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Инструмент, "UID");
    ИнтервалAPI = Перечисления.ТаймфреймыСвечей.ПолучитьИнтервалСвечейAPI(Таймфрейм);
    
    МассивСвечейAPI = ИнтеграцияTInvestAPI.ПолучитьСвечи(
        ИдентификаторИнструмента,
        ДатаНачала,
        ДатаОкончания,
        ИнтервалAPI,
		Соединение
    );
    
    Если МассивСвечейAPI = Неопределено Или МассивСвечейAPI.Количество() = 0 Тогда
        Возврат 0;
    КонецЕсли;
    
    ТаблицаСвечей = ПреобразоватьСвечиAPIВТаблицу(Инструмент, Таймфрейм, МассивСвечейAPI);
    КоличествоЗаписей = ЗаписатьСвечиВРегистр(ТаблицаСвечей);
    
    Возврат КоличествоЗаписей;
    
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьПараметрыЗагрузкиСвечей(Инструмент, ДатаНачала, ДатаОкончания, Таймфрейм)
    
	//Если Инструмент = Неопределено Тогда
	//    ВызватьИсключение "Не задан инструмент.";
	//КонецЕсли;
    
    Если ДатаНачала = Неопределено Тогда
        ВызватьИсключение "Не задана дата начала.";
    КонецЕсли;
    
    Если ДатаОкончания = Неопределено Тогда
        ВызватьИсключение "Не задана дата окончания.";
    КонецЕсли;
    
    Если ДатаНачала > ДатаОкончания Тогда
        ВызватьИсключение "Дата начала больше даты окончания.";
    КонецЕсли;
    
    Если Таймфрейм = Неопределено Тогда
        ВызватьИсключение "Не задан таймфрейм.";
    КонецЕсли;
    
КонецПроцедуры

Функция ПолучитьИнструментыДляЗагрузки(ПараметрыЗагрузки)
    
    ВариантИсточника = ПараметрыЗагрузки.ВариантИсточникаИнструментов;
    
    Если ВариантИсточника = Перечисления.ВариантыИсточникаИнструментов.ТекущиеПозиции Тогда
        Возврат ПолучитьИнструментыИзТекущихПозиций(ПараметрыЗагрузки);
        
	ИначеЕсли ВариантИсточника = Перечисления.ВариантыИсточникаИнструментов.ОдинИнструмент
		Или ВариантИсточника = Перечисления.ВариантыИсточникаИнструментов.СписокИнструментов Тогда
        Возврат ПолучитьОдинИнструментДляЗагрузки(ПараметрыЗагрузки);
        
    КонецЕсли;
    
    ВызватьИсключение "Не реализован вариант источника инструментов: " + Строка(ВариантИсточника);
    
КонецФункции

Функция ПолучитьОдинИнструментДляЗагрузки(ПараметрыЗагрузки)
    
    Результат = Новый Массив;
    
    Если Не ЗначениеЗаполнено(ПараметрыЗагрузки.СписокИнструментов) Тогда
        ВызватьИсключение "Не задан инструмент.";
	ИначеЕсли ТипЗнч(ПараметрыЗагрузки.СписокИнструментов) = Тип("СправочникСсылка.Инструменты") Тогда
	    Результат.Добавить(ПараметрыЗагрузки.СписокИнструментов);
	ИначеЕсли ТипЗнч(ПараметрыЗагрузки.СписокИнструментов) = Тип("Массив") Тогда
	    Результат = ПараметрыЗагрузки.СписокИнструментов;
	ИначеЕсли ТипЗнч(ПараметрыЗагрузки.СписокИнструментов) = Тип("СписокЗначений") Тогда
	    Результат = ПараметрыЗагрузки.СписокИнструментов.ВыгрузитьЗначения();
	Иначе
		ВызватьИсключение "Неожиданный тип параметра";
    КонецЕсли;
    
    Возврат Результат;
    
КонецФункции

Функция ПолучитьИнструментыИзТекущихПозиций(ПараметрыЗагрузки)
	
	УстановитьПривилегированныйРежим(Истина);
	
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |	Счета.Ссылка КАК Ссылка
    |ПОМЕСТИТЬ втСчета
    |ИЗ
    |	Справочник.Счета КАК Счета
    |ГДЕ
    |	Счета.Платформа = &Платформа
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	Остатки.Инструмент КАК Инструмент
    |ИЗ
    |	РегистрНакопления.ПозицииИнструментов.Остатки(
    |			,
    |			Счет В
    |				(ВЫБРАТЬ
    |					втСчета.Ссылка КАК Ссылка
    |				ИЗ
    |					втСчета КАК втСчета)) КАК Остатки
    |ГДЕ
    |	Остатки.КоличествоОстаток <> 0";
    
    Запрос.УстановитьПараметр("Платформа", ПараметрыЗагрузки.Платформа);
    
    Если ЗначениеЗаполнено(ПараметрыЗагрузки.Счет) Тогда
        Запрос.УстановитьПараметр("Счет", ПараметрыЗагрузки.Счет);
    Иначе
        Запрос.УстановитьПараметр("Счет", Справочники.Счета.ПустаяСсылка());
    КонецЕсли;
    
    Выборка = Запрос.Выполнить().Выбрать();
    
    Инструменты = Новый Массив;
    Пока Выборка.Следующий() Цикл
        Инструменты.Добавить(Выборка.Инструмент);
    КонецЦикла;
    
    Возврат Инструменты;
    
КонецФункции

Функция ОпределитьПериодЗагрузкиПоИнструменту(Инструмент, ПараметрыЗагрузки)
    
    РежимЗагрузки = ПараметрыЗагрузки.РежимЗагрузки;
    
    Если РежимЗагрузки = Перечисления.РежимыЗагрузкиСвечей.ПолнаяЗагрузка
    	Или РежимЗагрузки = Перечисления.РежимыЗагрузкиСвечей.ПерезагрузкаПериода Тогда
        Возврат Новый Структура("ДатаНачала,ДатаОкончания", ПараметрыЗагрузки.ДатаНачала, ПараметрыЗагрузки.ДатаОкончания);
    КонецЕсли;
    
    Если РежимЗагрузки = Перечисления.РежимыЗагрузкиСвечей.Дозагрузка Тогда
        
        ПоследняяДатаСвечи = ПолучитьПоследнююДатуСвечи(Инструмент, ПараметрыЗагрузки.Таймфрейм);
        
        Если Не ЗначениеЗаполнено(ПоследняяДатаСвечи) Тогда
            ДатаНачала = ПараметрыЗагрузки.ДатаНачала;
        Иначе
            ДатаНачала = ДобавитьШагКДате(ПоследняяДатаСвечи, ПараметрыЗагрузки.Таймфрейм);
        КонецЕсли;
        
        ДатаОкончания = ПараметрыЗагрузки.ДатаОкончания;
        
        Если ДатаНачала > ДатаОкончания Тогда
            Возврат Неопределено;
        КонецЕсли;
        
        Возврат Новый Структура("ДатаНачала ,ДатаОкончания", ДатаНачала, ДатаОкончания);
        
    КонецЕсли;
    
    ВызватьИсключение "Неизвестный режим загрузки: " + Строка(РежимЗагрузки);
    
КонецФункции

Функция ПолучитьПоследнююДатуСвечи(Инструмент, Таймфрейм)
    
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   МАКСИМУМ(Свечи.Период) КАК ПоследняяДата
    |ИЗ
    |   РегистрСведений.СвечиИнструментов КАК Свечи
    |ГДЕ
    |   Свечи.Инструмент = &Инструмент
    |   И Свечи.Таймфрейм = &Таймфрейм";
    
    Запрос.УстановитьПараметр("Инструмент", Инструмент);
    Запрос.УстановитьПараметр("Таймфрейм", Таймфрейм);
    
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        Возврат Выборка.ПоследняяДата;
    КонецЕсли;
    
    Возврат Неопределено;
    
КонецФункции

Функция ДобавитьШагКДате(ДатаЗначение, Таймфрейм)
    
    Если Таймфрейм = Перечисления.ТаймфреймыСвечей._Day Тогда
        Возврат НачалоДня(ДатаЗначение + 24 * 60 * 60);
        
    ИначеЕсли Таймфрейм = Перечисления.ТаймфреймыСвечей._1Hour Тогда
        Возврат ДатаЗначение + 60 * 60;
        
    ИначеЕсли Таймфрейм = Перечисления.ТаймфреймыСвечей._15Min Тогда
        Возврат ДатаЗначение + 15 * 60;
        
    ИначеЕсли Таймфрейм = Перечисления.ТаймфреймыСвечей._5Min Тогда
        Возврат ДатаЗначение + 5 * 60;
        
    ИначеЕсли Таймфрейм = Перечисления.ТаймфреймыСвечей._1Min Тогда
        Возврат ДатаЗначение + 60;
    КонецЕсли;
    
    ВызватьИсключение "Неизвестный таймфрейм: " + Строка(Таймфрейм);
    
КонецФункции

//Функция ЗагрузитьСвечиПоИнструменту(КлиентAPI, Инструмент, Таймфрейм, ДатаНачала, ДатаОкончания)
//    
//    ИдентификаторИнструмента = ПолучитьИдентификаторИнструментаДляAPI(Инструмент);
//    ИнтервалAPI = ПолучитьИнтервалСвечейAPI(Таймфрейм);
//    
//    МассивСвечейAPI = ИнтеграцияTInvestМаркетДанные.ПолучитьСвечи(
//        КлиентAPI,
//        ИдентификаторИнструмента,
//        ДатаНачала,
//        ДатаОкончания,
//        ИнтервалAPI
//    );
//    
//    Если МассивСвечейAPI = Неопределено Или МассивСвечейAPI.Количество() = 0 Тогда
//        Возврат 0;
//    КонецЕсли;
//    
//    ТаблицаСвечей = ПреобразоватьСвечиAPIВТаблицу(Инструмент, Таймфрейм, МассивСвечейAPI);
//    
//    Возврат ЗаписатьСвечиВРегистр(ТаблицаСвечей);
//    
//КонецФункции

Функция ОпределитьПериодДозагрузкиПоИнструменту(Инструмент, Таймфрейм, ДатаНачалаПоУмолчанию, ДатаОкончания)
    
    ПоследняяДатаСвечи = ПолучитьПоследнююДатуСвечи(Инструмент, Таймфрейм);
    
    Если ПоследняяДатаСвечи = Неопределено Тогда
        Возврат Новый Структура(
            "ДатаНачала,ДатаОкончания",
            ДатаНачалаПоУмолчанию,
            ДатаОкончания
        );
    КонецЕсли;
    
    ДатаНачала = ПолучитьДатуНачалаСПерекрытием(ПоследняяДатаСвечи, Таймфрейм);
    ДатаОкончания = НормализоватьДатуОкончанияПоТаймфрейму(ДатаОкончания, Таймфрейм);
    
    Если ДатаНачала > ДатаОкончания Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    Возврат Новый Структура(
        "ДатаНачала,ДатаОкончания",
        ДатаНачала,
        ДатаОкончания
    );
    
КонецФункции

Функция ПолучитьДатуНачалаСПерекрытием(ПоследняяДатаСвечи, Таймфрейм)
    
    Если Таймфрейм = Перечисления.ТаймфреймыСвечей.Day Тогда
        Возврат НачалоДня(ПоследняяДатаСвечи - 24 * 60 * 60);
        
    ИначеЕсли Таймфрейм = Перечисления.ТаймфреймыСвечей.Hour Тогда
        Возврат НачалоЧаса(ПоследняяДатаСвечи - 60 * 60);
        
    ИначеЕсли Таймфрейм = Перечисления.ТаймфреймыСвечей.Min15 Тогда
        Возврат ПоследняяДатаСвечи - 15 * 60;
        
    ИначеЕсли Таймфрейм = Перечисления.ТаймфреймыСвечей.Min5 Тогда
        Возврат ПоследняяДатаСвечи - 5 * 60;
        
    ИначеЕсли Таймфрейм = Перечисления.ТаймфреймыСвечей.Min1 Тогда
        Возврат ПоследняяДатаСвечи - 60;
    КонецЕсли;
    
    ВызватьИсключение "Неизвестный таймфрейм: " + Строка(Таймфрейм);
    
КонецФункции

Функция НормализоватьДатуОкончанияПоТаймфрейму(ДатаОкончания, Таймфрейм)
    
    Если Таймфрейм = Перечисления.ТаймфреймыСвечей.Day Тогда
        Возврат КонецДня(ДатаОкончания);
    КонецЕсли;
    
    Возврат ДатаОкончания;
    
КонецФункции

Функция ПреобразоватьСвечиAPIВТаблицу(Инструмент, Таймфрейм, МассивСвечейAPI)
    
    Таблица = Новый ТаблицаЗначений;
    Таблица.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
    Таблица.Колонки.Добавить("Инструмент");
    Таблица.Колонки.Добавить("Таймфрейм");
    Таблица.Колонки.Добавить("Open", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 6)));
    Таблица.Колонки.Добавить("High", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 6)));
    Таблица.Колонки.Добавить("Low", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 6)));
    Таблица.Колонки.Добавить("Close", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 6)));
    Таблица.Колонки.Добавить("Volume", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0)));
    Таблица.Колонки.Добавить("Источник", Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Тип("СправочникСсылка.ИсточникиДанных"))));
    
    Для Каждого СвечаAPI Из МассивСвечейAPI Цикл
        
        СтрокаТаблицы = Таблица.Добавить();
        СтрокаТаблицы.Период = ИнтеграцияTInvestСлужебный.ПреобразоватьСтрокуВДату(СвечаAPI.time);
        СтрокаТаблицы.Инструмент = Инструмент;
        СтрокаТаблицы.Таймфрейм = Таймфрейм;
        СтрокаТаблицы.Open = ИнтеграцияTInvestСлужебный.СуммаИзКотировки(СвечаAPI.open);
        СтрокаТаблицы.High = ИнтеграцияTInvestСлужебный.СуммаИзКотировки(СвечаAPI.high);
        СтрокаТаблицы.Low = ИнтеграцияTInvestСлужебный.СуммаИзКотировки(СвечаAPI.low);
        СтрокаТаблицы.Close = ИнтеграцияTInvestСлужебный.СуммаИзКотировки(СвечаAPI.close);
        СтрокаТаблицы.Volume = ?(СвечаAPI.Свойство("volume"), СвечаAPI.volume, 0);
        СтрокаТаблицы.Источник = Справочники.ИсточникиДанных.ТИнвест;
        
    КонецЦикла;
    
    Возврат Таблица;
    
КонецФункции

Функция ЗаписатьСвечиВРегистр(ТаблицаСвечей)
    
    Если ТаблицаСвечей.Количество() = 0 Тогда
        Возврат 0;
    КонецЕсли;
    
    Инструмент = ТаблицаСвечей[0].Инструмент;
    Таймфрейм = ТаблицаСвечей[0].Таймфрейм;
    
    МинПериод = ТаблицаСвечей[0].Период;
    МаксПериод = ТаблицаСвечей[0].Период;
    
    Для Каждого СтрокаСвечи Из ТаблицаСвечей Цикл
        Если СтрокаСвечи.Период < МинПериод Тогда
            МинПериод = СтрокаСвечи.Период;
        КонецЕсли;
        Если СтрокаСвечи.Период > МаксПериод Тогда
            МаксПериод = СтрокаСвечи.Период;
        КонецЕсли;
    КонецЦикла;
    
    СуществующиеСвечи = ПолучитьСуществующиеСвечи(Инструмент, Таймфрейм, МинПериод, МаксПериод);
    ИндексСуществующих = ПостроитьИндексСвечей(СуществующиеСвечи);
    
    НаборЗаписей = РегистрыСведений.СвечиИнструментов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Инструмент.Установить(СтрокаСвечи.Инструмент);
	НаборЗаписей.Отбор.Таймфрейм.Установить(СтрокаСвечи.Таймфрейм);
	НаборЗаписей.Прочитать();
	
    КоличествоИзменений = 0;
    
    Для Каждого СтрокаСвечи Из ТаблицаСвечей Цикл
        
        Ключ = ПолучитьКлючСвечи(СтрокаСвечи.Период, СтрокаСвечи.Инструмент, СтрокаСвечи.Таймфрейм);
		
		СуществующаяСтрока = ИндексСуществующих.Получить(Ключ);
		Если СуществующаяСтрока <> Неопределено Тогда
		    
		    Если СвечаИзменилась(СуществующаяСтрока, СтрокаСвечи) Тогда
		        Запись = НаборЗаписей.Добавить();
		        Запись.Период = СтрокаСвечи.Период;
		        Запись.Инструмент = СтрокаСвечи.Инструмент;
		        Запись.Таймфрейм = СтрокаСвечи.Таймфрейм;
		        Запись.Open = СтрокаСвечи.Open;
		        Запись.High = СтрокаСвечи.High;
		        Запись.Low = СтрокаСвечи.Low;
		        Запись.Close = СтрокаСвечи.Close;
		        Запись.Volume = СтрокаСвечи.Volume;
		        Запись.Источник = СтрокаСвечи.Источник;
		        КоличествоИзменений = КоличествоИзменений + 1;
		    КонецЕсли;
		    
		Иначе
		    
		    Запись = НаборЗаписей.Добавить();
		    Запись.Период = СтрокаСвечи.Период;
		    Запись.Инструмент = СтрокаСвечи.Инструмент;
		    Запись.Таймфрейм = СтрокаСвечи.Таймфрейм;
		    Запись.Open = СтрокаСвечи.Open;
		    Запись.High = СтрокаСвечи.High;
		    Запись.Low = СтрокаСвечи.Low;
		    Запись.Close = СтрокаСвечи.Close;
		    Запись.Volume = СтрокаСвечи.Volume;
		    Запись.Источник = СтрокаСвечи.Источник;
		    КоличествоИзменений = КоличествоИзменений + 1;
		    
		КонецЕсли;
        
    КонецЦикла;
    
    Если КоличествоИзменений > 0 Тогда
        НаборЗаписей.Записать();
    КонецЕсли;
    
    Возврат КоличествоИзменений;
    
КонецФункции

Функция ПолучитьСуществующиеСвечи(Инструмент, Таймфрейм, ДатаНачала, ДатаОкончания)
    
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   Свечи.Период КАК Период,
    |   Свечи.Инструмент КАК Инструмент,
    |   Свечи.Таймфрейм КАК Таймфрейм,
    |   Свечи.Open КАК Open,
    |   Свечи.High КАК High,
    |   Свечи.Low КАК Low,
    |   Свечи.Close КАК Close,
    |   Свечи.Volume КАК Volume,
    |   Свечи.Источник КАК Источник
    |ИЗ
    |   РегистрСведений.СвечиИнструментов КАК Свечи
    |ГДЕ
    |   Свечи.Инструмент = &Инструмент
    |   И Свечи.Таймфрейм = &Таймфрейм
    |   И Свечи.Период МЕЖДУ &ДатаНачала И &ДатаОкончания";
    
    Запрос.УстановитьПараметр("Инструмент", Инструмент);
    Запрос.УстановитьПараметр("Таймфрейм", Таймфрейм);
    Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
    Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
    
    Возврат Запрос.Выполнить().Выгрузить();
    
КонецФункции

Функция ПостроитьИндексСвечей(ТаблицаСвечей)
    
    Индекс = Новый Соответствие;
    
    Для Каждого СтрокаСвечи Из ТаблицаСвечей Цикл
        Ключ = ПолучитьКлючСвечи(СтрокаСвечи.Период, СтрокаСвечи.Инструмент, СтрокаСвечи.Таймфрейм);
        Индекс.Вставить(Ключ, СтрокаСвечи);
    КонецЦикла;
    
    Возврат Индекс;
    
КонецФункции

Функция ПолучитьКлючСвечи(Период, Инструмент, Таймфрейм)
    Возврат Формат(Период, "ДФ=yyyyMMddHHmmss") + "|" + Строка(Инструмент) + "|" + Строка(Таймфрейм);
КонецФункции

Функция СвечаИзменилась(СуществующаяСтрока, НоваяСтрока)
    
    Возврат
        СуществующаяСтрока.Open <> НоваяСтрока.Open
        Или СуществующаяСтрока.High <> НоваяСтрока.High
        Или СуществующаяСтрока.Low <> НоваяСтрока.Low
        Или СуществующаяСтрока.Close <> НоваяСтрока.Close
        Или СуществующаяСтрока.Volume <> НоваяСтрока.Volume
        Или СуществующаяСтрока.Источник <> НоваяСтрока.Источник;
    
КонецФункции
	
#КонецОбласти
